Autodesk.Revit.DB.FabricationRodInfo.GetRodLength(System.Int32)
Get the current rod length. If the rod is the length will include structural extension.
rodIndex:
The rod index.
Returns:
returns rod length of hanger for specified end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.SetRodLength(System.Int32,System.Double)
Set the rod length of the hanger for the specified rod index, excluding top extension. The hanger must not be set to be auto-hosted.
rodIndex:
The rod index.
Returns:
returns true if it worked.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rod length cannot be set because the hanger is set to automatically host to other elements.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.GetRodStructureExtension(System.Int32)
Gets the length of the rod's top extension into structure.
rodIndex:
The rod index.
Returns:
returns the extension that will be applied if the rod is attached to structure.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.SetRodStructureExtension(System.Int32,System.Double)
Set the length of the rod's top extension into structure. The rod must be attached to structure.
rodIndex:
The rod index.
extension:
Distance the rod will extend into the structure.
Returns:
returns true if it worked.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rods do not attached to any structue.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo.SetBearerExtension(System.Int32,System.Double)
Sets the bearer extension. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
length:
The new length of bearer extension.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.GetBearerExtension(System.Int32)
Gets the bearer extension. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.SetRodLockedWithHost(System.Int32,System.Boolean)
Locks the rod with the host. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
locked:
Locks the rod with the host.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.IsRodLockedWithHost(System.Int32)
Checks if the rod is locked with the host. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
Returns:
True if the rod is locked with its host.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.AttachToHanger(Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ)
Attaches the hanger rod to another bearer hanger.
hangerId:
Id of the bearer hanger to which the rod attaches.
rodIndex:
The index of the rod.
position:
The position of the rod end. It should be on bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The hanger is not a bearer hanger.
-or-
the point is not on hanger bearer centerline.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.AttachToStructure
Attaches to the nearest structural element.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.SetRodEndPosition(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the position of the rod end. The method is applicable only for bearer hanger.
rodIndex:
The index of the rod.
position:
The position of the rod end.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Invalid rod position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The hanger is not a bearer hanger.
Since:
2017

Autodesk.Revit.DB.FabricationRodInfo.GetRodEndPosition(System.Int32)
Gets the position of the rod end.
rodIndex:
The index of the rod.
Returns:
The position of the rod end.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.GetRodAttachedElementId(System.Int32)
Gets the id of the attached component for the specified rod.
rodIndex:
The index of the specified rod.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
the index rodIndex is should be in range of rod count.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The rods do not attached to any structue.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationRodInfo.IsAttachedToStructure
Checks if the hanger is attached to structure.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.RodCount
Gets the number of rods.
Since:
2016

Autodesk.Revit.DB.FabricationRodInfo.CanRodsBeHosted
Controls whether the hanger's rod's will be automatically hosted by other elements.
Since:
2018

Autodesk.Revit.DB.FabricationRodInfo
The rod information of the fabrication part.
Remarks:
A fabrication part may have one or more rods. The FabricationRodInfo stores the rod information of the fabrication part.
Since:
2016